  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/4fd31ecf-c504-4399-9d87-a5072018e6b0/terraform-bin plan -no-color -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway will be created
+ resource "azurerm_nat_gateway" "nat_gateway" {
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + location                = "eastus"
    + name                    = "my-secure-nat-gw"
    + resource_group_name     = "my-secure-nat-gw"
    + resource_guid           = (known after apply)
    + sku_name                = "Standard"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"] will be created
+ resource "azurerm_nat_gateway_public_ip_association" "association" {
    + id                   = (known after apply)
    + nat_gateway_id       = (known after apply)
    + public_ip_address_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1"
  }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>